class Note:                # class - оголошуємо власний тип "Запис"
    def __init__(          # def __init__ - конструктор (фукція, що будує об'єкт)
            self,          # self - посилання на сторюваний об'єкт
            note_id: int,  # note_id: int - підказка типу: очікуємо ціле число
            title: str,    # title: str - підказка типу: очікуємо рядок (назва)
            body: str = "" # body: str = "" - рядок, порожній за змовчуванням
    ):
        self.id = note_id  # зберігаємо id всередині об'єкта
        self.title = title # зберігаємо назву
        self.body = body   # зберігаємо текст запису